# 두개의 데이터프레임 합치기

In [1]:
import pandas as pd

In [24]:
l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Fred', 'job': "developer"}]

l2 = [{'name': 'Ed', 'job': "dentist"},
      {'name': 'Jack', 'job': "farmer"},
      {'name': 'Ted', 'job': "designer"}]
         
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])

In [25]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer

In [26]:
df2

   name       job
0    Ed   dentist
1  Jack    farmer
2   Ted  designer

## pd.concat
두번째 데이터프레임을 첫번째 데이터프레임의 새로운 로우(행)로 합칩니다.

In [18]:
result = pd.concat([df1, df2], ignore_index=True)  # 인덱스 중복을 막기위해 ignore_index=True 사용

In [19]:
result

   name        job  age  country
0  John    teacher  NaN      NaN
1  Nate    student  NaN      NaN
2  Fred  developer  NaN      NaN
3   NaN        NaN  NaN      NaN
4   NaN        NaN  NaN      NaN
5   NaN        NaN  NaN      NaN

## df.append
두번째 데이터프레임을 첫번째 데이터프레임의 새로운 로우(행)로 합칩니다.

In [14]:
# result = df1.append(df2, ignore_index=True) # 더이상 사용 안함

## pd.concat
두번째 데이터프레임을 첫번째 데이터프레임의 새로운 컬럼(열)으로 합칩니다.

In [33]:
l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Jack', 'job': "developer"}]

l2 = [{'age': 25, 'country': "U.S"},
      {'age': 30, 'country': "U.K"},
      {'age': 45, 'country': "Korea"}]

In [34]:
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['age', 'country'])

In [35]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Jack  developer

In [36]:
df2

   age country
0   25     U.S
1   30     U.K
2   45   Korea

In [37]:
result = pd.concat([df1, df2], axis=1, ignore_index=True)  # 열로 합치므로 axis=1 사용

In [38]:
result

      0          1   2      3
0  John    teacher  25    U.S
1  Nate    student  30    U.K
2  Jack  developer  45  Korea

# 두개의 리스트를 묶어서 데이터프레임으로 생성하기

In [39]:
label = [1,2,3,4,5]
prediction = [1,2,2,5,5]

In [41]:
comparison = pd.DataFrame(
    {'label': label,
     'prediction': prediction
    })

In [42]:
comparison

   label  prediction
0      1           1
1      2           2
2      3           2
3      4           5
4      5           5